tap "homebrew/cask"
tap "aws/tap"

brew "wget"
brew "aws-sam-cli"
brew "grep", link: true
brew "gh"
brew "ghq"
brew "peco"
brew "goenv"
brew "pipenv"
brew "pyenv"
brew "mas"

cask "1password"
cask "bitwarden"
cask "alfred"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "visual-studio-code"
cask "docker"
cask "zoom"
cask "discord"
cask "spotify"

mas "Slack", id: 803453959
mas "Bear", id: 1091189122
mas "Magnet", id: 441258766
mas 'LINE', id: 539883307
