tap "aws/tap"
tap "derailed/k9s"
tap "homebrew/bundle"

brew "aws-sam-cli"
brew "berglas"
brew "freetds"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "goenv", args: ["HEAD"]
brew "graphviz"
brew "grep"
brew "gron"
brew "jenv"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "kubie"
brew "kustomize"
brew "libidn2"
brew "maven"
brew "nkf"
brew "nodebrew"
brew "openjdk@11"
brew "peco"
brew "pipenv"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "rustup-init"
brew "starship"
brew "terraform_landscape"
brew "tfenv"
brew "tnftp"
brew "tree"
brew "trivy"
brew "wget"
brew "derailed/k9s/k9s"

cask "1password"
cask "alfred"
cask "bitwarden"
cask "discord"
cask "docker"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "iterm2"
cask "spotify"
cask "temurin"
cask "visual-studio-code"
cask "zoom"

mas "slack-for-desktop", id: 803453959
mas "Bear", id: 1091189122
mas "Magnet", id: 441258766
mas 'LINE', id: 539883307
mas 'skitch', id: 425955336
mas "yoink", id: 457622435

vscode "42crunch.vscode-openapi"
vscode "arjun.swagger-viewer"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "marlon407.code-groovy"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "msysyamamoto.vscode-digdag"
vscode "oderwat.indent-rainbow"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "techer.open-in-browser"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
